assignment1/httperf/commands.txt
sudo apt install automake libtool

https://chatgpt.com/share/69693003-e464-800b-8521-6b90b1a230aa

curl http://10.53.6.159/test.php


<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/share/tsung/tsung-1.0.dtd">

<tsung loglevel="notice" version="1.0">

  <!-- Where Tsung runs -->
  <clients>
    <client host="localhost" maxusers="100"/>
  </clients>

  <!-- Your Apache web server -->
  <servers>
    <server host="10.53.6.159" port="80" type="tcp"/>
  </servers>

  <!-- Closed workload definition -->
  <load duration="300" unit="second">
    <arrivalphase phase="1" duration="300" unit="second">
      <!-- Total users in the system -->
      <users maxnumber="20" arrivalrate="5" unit="second"/>
    </arrivalphase>
  </load>

  <!-- User behavior -->
  <sessions>
    <session probability="100" name="webtest" type="ts_http">

      <!-- One HTTP request -->
      <transaction name="request">
        <request>
          <http url="/test.php" version="1.1"/>
        </request>
      </transaction>

      <!-- Think time (important for closed system) -->
      <thinktime value="6"/>

    </session>
  </sessions>

</tsung>



/usr/lib/x86_64-linux-gnu/tsung/bin/tsung_stats.pl


shikhar-rai@shikhar-rai-ThinkPad-E16-Gen-3:~/.tsung/log/20260115-2336$ sudo find / -name tsung_stats.pl 2>/dev/null
[sudo] password for shikhar-rai: 
/usr/lib/x86_64-linux-gnu/tsung/bin/tsung_stats.pl


hostname -I

httperf --server 172.31.235.156  --uri /test.php --rate 50 --num-conns 500

httperf --server 10.51.5.140 --port 80 --uri /test.php --rate 50 --num-conns 500


viren@UnknownDevice:/mnt/d/IITB/Courses/SEM 2/CS 681/Performance-Analysis-CS681$ httperf --server 172.31.235.156  --uri /test.php --rate 50 --num-conns 500
httperf --client=0/1 --server=172.31.235.156 --port=80 --uri=/test.php --rate=50 --send-buffer=4096 --recv-buffer=16384 --num-conns=500 --num-calls=1
httperf: warning: open file limit > FD_SETSIZE; limiting max. # of open files to FD_SETSIZE    
Maximum connect burst length: 1

Total: connections 500 requests 500 replies 500 test-duration 9.984 s

Connection rate: 50.1 conn/s (20.0 ms/conn, <=2 concurrent connections)
Connection time [ms]: min 0.3 avg 4.1 max 20.0 median 3.5 stddev 2.0
Connection time [ms]: connect 0.0
Connection length [replies/conn]: 1.000

Request rate: 50.1 req/s (20.0 ms/req)
Request size [B]: 75.0

Reply rate [replies/s]: min 50.0 avg 50.0 max 50.0 stddev 0.0 (1 samples)
Reply time [ms]: response 4.1 transfer 0.0
Reply size [B]: header 148.0 content 64.0 footer 0.0 (total 212.0)
Reply status: 1xx=0 2xx=500 3xx=0 4xx=0 5xx=0

CPU time [s]: user 2.63 system 6.64 (user 26.3% system 66.5% total 92.8%)
Net I/O: 14.1 KB/s (0.1*10^6 bps)

Errors: total 0 client-timo 0 socket-timo 0 connrefused 0 connreset 0
Errors: fd-unavail 0 addrunavail 0 ftab-full 0 other 0



viren@UnknownDevice:/mnt/d/IITB/Courses/SEM 2/CS 681/Performance-Analysis-CS681$ httperf --server 10.51.5.140 --port 80 --uri /test.php --rate 50 --num-conns 500
httperf --client=0/1 --server=10.51.5.140 --port=80 --uri=/test.php --rate=50 --send-buffer=4096 --recv-buffer=16384 --num-conns=500 --num-calls=1
httperf: warning: open file limit > FD_SETSIZE; limiting max. # of open files to FD_SETSIZE
Maximum connect burst length: 1

Total: connections 500 requests 500 replies 500 test-duration 10.027 s

Connection rate: 49.9 conn/s (20.1 ms/conn, <=31 concurrent connections)
Connection time [ms]: min 14.7 avg 79.8 max 1108.9 median 30.5 stddev 149.7
Connection time [ms]: connect 40.8
Connection length [replies/conn]: 1.000

Request rate: 49.9 req/s (20.1 ms/req)
Request size [B]: 72.0

Reply rate [replies/s]: min 49.6 avg 49.9 max 50.2 stddev 0.4 (2 samples)
Reply time [ms]: response 39.0 transfer 0.0
Reply size [B]: header 148.0 content 64.0 footer 0.0 (total 212.0)
Reply status: 1xx=0 2xx=500 3xx=0 4xx=0 5xx=0

CPU time [s]: user 2.39 system 6.87 (user 23.8% system 68.5% total 92.3%)
Net I/O: 13.9 KB/s (0.1*10^6 bps)

Errors: total 0 client-timo 0 socket-timo 0 connrefused 0 connreset 0
Errors: fd-unavail 0 addrunavail 0 ftab-full 0 other 0